export const users = [
  {
    active: true,
    userName: `Егор Черных`,
    userGames: [`Hitman (2016)`, `серия Tropico `, 'Spore', 'The Simpsons Hit & Run', 'Beyond Good and Evil', 'Zoo Tycoon 2', 'Psychonauts', 'Disney G-Force', 'Sleeping Dogs'],
    userTopics: [`сны`, 'ходьба', 'после людей', 'кунг-фу'],
    userRank: 1,
  },
  {
    active: true,
    userName: `D3mark0`,
    userGames: [`Genshin Impact`],
    userTopics: [`развлечения `, 'скука'],
    userRank: 2,
  },
  {
    active: true,
    userName: `мяувау`,
    userGames: [`Shenmue 1 & 2`, `Fallout 4`, 'BioShock'],
    userTopics: [`уязвимость `, 'самовосприятие', 'деформация', 'тело', 'внешний вид'],
    userRank: 2,
  },
  {
    active: true,
    userName: `Диоген без бочки`,
    userGames: [`Grand Theft Auto: San Andreas`, `The Elder Scrolls V: Skyrim`],
    userTopics: [`Смерть `, 'Память', 'Время', 'Любая тема, которая начинается на букву "П"'],
    userRank: 3,
  },
  {
    active: true,
    userName: `mitreshell`,
    userGames: [`The Elder Scrolls V: Skyrim`, `The Sims 3`, 'Minecraft'],
    userTopics: [`запахи`, 'зима', 'весна', 'что будет после смерти', 'грибная тема', 'чемпион мира по шахматам'],
    userRank: 3,
  },
  {
    active: true,
    userName: `akiaplow`,
    userGames: [`Dark Souls`, `Fortnite`, 'Chibi-Robo!', 'F-Zero GX', 'Metroid Prime', 'Phantasy Star Online'],
    userTopics: [`уличная съёмка`, 'b/w', 'текстуры/макро'],
    userRank: 3,
  },

  {
    active: true,
    userName: `Uberstein`,
    userGames: ['Игры девяностых и нулевых в реалистичном-военном и фэнтезийном сеттингах', `Delta Force`, `Men of War`, 'Arx Fatalis', 'Shadow Tower'],
    userTopics: [`Покинутые и гнетущие пространства`, 'Постановочная портретная съёмка', 'Фотографии баталий и постановки исторически значимых событий'],
    userRank: 4,
  },
  {
    active: true,
    userName: `Константин Ремизов`,
    userGames: [`Metal Gear Solid V: The Phantom Pain`, `Mount And Blade 2: Bannerlord`, 'Neverwinter Nights 2', 'The Good Life', 'Dead Rising', 'Harry Potter and the Chamber of Secrets', "Assassin's Creed: Brotherhood", 'Loki: Heroes of Mythology', 'The Elder Scrolls III: Morrowind', 'The Elder Scrolls IV: Oblivion', 'Empire Earth', 'Grand Theft Auto IV', 'Grand Theft Auto III', 'The Sims 2/3/4', 'Watch Dogs 1/2', 'Dungeon Siege: Legends of Aranna', 'L. A. Noire', 'True Crime: New York City', 'Resident Evil 6', "Din's Legacy", 'XCOM 2', 'Second Life' ],
    userTopics: [`неловкий момент`, 'комиксы', 'история россии', 'эротика', 'еда', 'сказки народов мира', 'двойники', 'деньги', 'утопии', 'самые уродливые фотографии'],
    userRank: 4,
  },
];

export const battles = [
    {
      participants: 
        [
          `Диоген без бочки`,
          `mitreshell`,
        ],
      participantDescription: 
        [
          `Всё начиналось с туманного поля, а закончилось сточной канавой. Грибной коктейль явно оказался лишним\n\n(Для фоток урезал размер изображения, минимизировал прогрузку чанков и напивался случайными зельями до упаду)`,
          `<i>сны в ведьмином доме, на сервере greb</i>\n\n~~~~~~~~\n\n(таинственные рисунки жителей вставлены в игру при помощи техники mapart. есть такой сайт <a href="https://mc-map.djfun.de/">https://mc-map.djfun.de/</a>, который позволяет из загруженного изображения сделать файлы внутриигровых карт. этими файлами нужно заменить файлы оригинальных карт в папке data, и можно складывать из них картинки!)`
        ],
      game: `Minecraft 1.14.4`,
      battleExpDate: `2022-11-22 23:59`,
      battleName: `Диоген без бочки и mitreshell | Minecraft 1.14.4 | Грибная тема`,
      battleTopic:`Грибная тема`,
      battleCondition: `без модификаций и постобработки`,
      folderPath: `./photos/Диоген без бочки и mitreshell Minecraft/`,
      voteEmbed: `<script async src="https://telegram.org/js/telegram-widget.js?21" data-telegram-post="ingameph_polls/40" data-width="100%"></script>`,
      voteExpDate: `2022-11-29 23:59`,
      winner: `mitreshell`,
    },
   
    {
      participants: [`Uberstein`, `Константин Ремизов`],
      participantDescription: 
        [
          ` `,
          `<b>сцены из жизни Андрея Боголюбского</b>\n\n1. Андрей со своим отцом, Юрием Долгоруким, который так и норовит отправить его княжить то в Рязань, то в Вышгород\n2. Единственный выживший после ночного нападения, Андрей бежит из Рязани в одном сапоге (лето 1154)\n3. Андрей задумывает вывезти из Вышгорода икону Божьей матери, которая позже станет известна как Владимирская (лето 1155)\n4. первое чудо из "Сказания о чудесах Владимирской иконы Божией Матери": проводник Андрея, исчезнувший было под водой при поиске брода через Вазузу, появился невредимым посреди реки после того, как Андрей помолился иконе (осень 1155)\n5. Андрей, унаследовав Суздальское княжество после смерти отца, решает сделать Владимир своей столицей - и самым престижным городом Руси (около 1159)\n6. Андрей разворачивает во Владимире масштабное строительство. Владимир хорошеет.\n7. Андрей проявляет себя как завоеватель (1164-1174); при этом после захвата и уничтожения нескольких городов в Волжской Булгарии он больше не принимает личного участия в боевых действиях и не покидает пределов своего княжества\n8. посланные Андреем войска захватывают и грабят Киев, после чего он перестаёт восприниматься как столица Руси (март 1169).\n9. заговор Кучковичей — родственников жены Андрея (она сама, по мнению ряда источников, тоже была причастна) - с целью его убийства; июнь 1174.\n10. ночь с 28 на 29 июня 1174; убийство Андрея в Лестничной башне его имения в Боголюбово\n\nЭта серия появилась из-за того, что мне очень не хотелось снимать битвы, которые в bannerlord и без меня снимают все кому не лень, и хотелось вместо этого приблизиться к неуклюжей иллюстративности летописных миниатюр и более поздних лубочных картинок (особенно ценных для меня своим ироничным отношением к власти и официальным нарративам). Мне хотелось рассказать едкую и смешную историю, и биография Андрея Боголюбского довольно быстро пришла на ум. Вдобавок,  в игре есть редактор персонажей, и мне было интересно воссоздать в нём - насколько это возможно - знаменитую реконструкцию внешности Андрея, сделанную в 1939 Михаилом Герасимовым.\n\nАндрей кажется мне фигурой одновременно одиозной и трагикомической. Вспыльчивый деспот, сосредоточивший в своих руках небывалую власть, устранивший из своего окружения всех, кто мог быть равным ему, уничтоживший все привычные механизмы, которые могли бы позволить подданным сместить или изгнать его — и поэтому убитый ими. Манипулятор, вливавший огромные ресурсы в насаждение совершенно искусственной идеи богоизбранности своей земли и своей власти, при жизни не очень успешный в  этом, но спустя пять с лишним веков причисленный к лику святых. Ужасно! Очаровательно! Не могу не отметить, как легко мне понять неприязнь Андрея к столице, нежелание находиться там, непонимание того, отчего все так стремятся туда уехать (разве что в моём случае речь идёт о совсем другом городе, к основанию которого Андрей был причастен).\n\nо том, как это сделано:\n\nЯ использовал Reshade прежде всего для многократных экспозиций через всевозможные маски, но ещё для датамошинга, эффектов мозаики и калейдоскопа и расположения геометрических фигур в глубине сцены (это помогло в том числе создать нимбы для снимка 3).\n\nВ игре есть фоторежим, но перемещение свободной камеры в нём ограничено, а в интерьерах она вообще не включается, поэтому я использовал Cheat Engine, чтобы её двигать. некоторые сцены я снимал за пределами фоторежима, на глобальной карте (например, почти весь четвёртый снимок - кроме руки Богородицы). Там я тоже использовал Cheat Engine — не только для камеры, но и для отключения интерфейса, перемещения персонажей и изменения размера некоторых из них (перед этим я ввёл в консоли campaign.set_parties_visible, чтобы на карте отображались все отряды).\n\nДля снимка 6 я таким же образом двигал по глобальной карте башни замков, повесил их в небе и снял на фоне чёрного тумана, чтобы наложить на кадр с Андреем в городе. При этом зависшая над ним четвёртая башня в снегу - не мультиэкспозиция, а реальная городская башня из той же сцены, которую я уменьшил и повесил перед камерой. справа Андрей смотрит на нас через одну из её бойниц. сепия в этой части картинки - один из встроенных фильтров фоторежима.\n\n
Ещё Cheat Engine пригодился для деструктивных воздействий: так появились руки Юрия Долгорукого, своя атмосфера на снимке 5, некоторые шейдерные эффекты на снимках 1 и 3 — и, конечно, удачно сломавшиеся текстуры на восьмом. Убийство Андрея тоже было совершено с помощью Cheat Engine: я убавил его здоровье и поднял его над лестницей, в результате чего он упал на неё и потерял сознание. Зайдя в фоторежим, чтобы игра не выкинула меня на глобальную карту, я расставил вокруг тела несколько npc, вообще-то находившихся в других помещениях замка - на снимке они в тех позах, в которых застыли, когда я поставил игру на паузу.\n\nНаконец, последнее, для чего я использовал Cheat Engine - это работа со светом и цветом. Что касается света, то в основном я просто делал ярче или темнее те или иные сцены, чтобы разные слои мультиэкспозиции лучше сочетались между собой. Исключение здесь составляет изображение Андрея на первом снимке — я снимал его отдельно от Юрия, на улице, и делал какие-то непростительные (и привычные для себя) вещи с параметрами солнечного света и атмосферного освещения. На седьмом снимке, где Андреев двое, цвета одежды правого из них я тоже изменял с помощью Cheat Engine (и вообще использовал Cheat Engine чтобы посадить его на этот стул, на который в самой игре просто так не сядешь; Cheat Engine то Cheat Engine сё Cheat Engine Cheat Engine Cheat Engine)`
      ],
      game: `Mount & Blade II: Bannerlord`,
      battleExpDate: `2022-12-11 23:59`,
      battleName: `Uberstein и Константин Ремизов | Mount & Blade II: Bannerlord | История России`,
      battleTopic:`История России`,
      battleCondition: `от 7 снимков`,
      folderPath: `./photos/Uberstein и Константин Ремизов Bannerlord/`,
      voteEmbed: `https://telegram.org/js/telegram-widget.js?21`,
      voteExpDate: null,
      winner: null,
    },
];